# Data Visualizations with Python 1

1. Import Libraries and Data

2. Check for Outliers

3. Check New Customer Dataframe

4. Data Wrangling

5. Combine the Dataframes

Import Dataframes

In [1]:
# Import Libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
path = r'C:\Users\rpa21\Instacart Basket Analysis'

In [3]:
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [4]:
df_grp_ords_prods_merge3 = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'grp_ords_prods_merge3.pkl'))

In [5]:
df_grp_ords_prods_merge3.shape

(32404859, 26)

2. Check for Outliers

In [6]:
df_grp_ords_prods_merge3.loc[df_grp_ords_prods_merge3['prices'] > 100]

Empty DataFrame
Columns: [product_id, product_name, aisle_id, department_id, prices, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_last_order, add_to_cart_order, reordered, _merge, price_range_loc, busiest_day, busiest days, Busiest days, Busiest_day, busiest_period_of_day, max_order, loyalty_flag, average price, spender_flag, customer_frequency, frequency_flag]
Index: []

[0 rows x 26 columns]

3. Check New Customer Dataframe

In [7]:
df_cust.shape

(206209, 10)

In [8]:
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

4. Data Wrangling

Renaming Columns

In [10]:
# Renaming Surname to Last Name
df_cust.rename(columns = {'Surnam' : 'Last Name'}, inplace = True)

In [11]:
# Renaming Dependents column
df_cust.rename(columns = {'n_dependants' : 'number_of_dependants'}, inplace = True)

In [12]:
# Renaming STATE to State
df_cust.rename(columns = {'STATE' : 'State'}, inplace = True)

In [13]:
# Checking name changes
df_cust.head()

,user_id,First Name,Last Name,Gender,State,Age,date_joined,number_of_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

Changing data types for user_id

In [16]:
df_cust['user_id'] = df_cust['user_id'].astype('str')

In [17]:
df_grp_ords_prods_merge3['user_id'] = df_grp_ords_prods_merge3['user_id'].astype('str')

Check for mixed data types

In [18]:
# Create a dataframe
df_testing = pd.DataFrame()

In [19]:
# Create a mixed type column
df_testing['mix'] = ['a', 'b', 1, True]

In [20]:
df_testing.head()

    mix
0     a
1     b
2     1
3  True

In [21]:
# Check for mixed types
for col in df_testing.columns.tolist():
  weird = (df_testing[[col]].applymap(type) != df_testing[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_testing[weird]) > 0:
    print (col)

mix

C:\Users\rpa21\AppData\Local\Temp\ipykernel_20388\2320309195.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_testing[[col]].applymap(type) != df_testing[[col]].iloc[0].apply(type)).any(axis = 1)

In [22]:
# Convert the mixed data types to string
df_testing['mix'] = df_testing['mix'].astype('str')

Check for Missing Values

In [23]:
df_cust.isnull().sum()

user_id                     0
First Name              11259
Last Name                   0
Gender                      0
State                       0
Age                         0
date_joined                 0
number_of_dependants        0
fam_status                  0
income                      0
dtype: int64

In [24]:
df_nan = df_cust[df_cust['First Name'].isnull()==True]

In [25]:
df_nan

,user_id,First Name,Last Name,Gender,State,Age,date_joined,number_of_dependants,fam_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

The missing values are only around 5% of the data. The missing values are only the First Name of the customer and the remaining relevant data is present. I have decided to leave the values in the dataframe.

Looking for full duplicates in the dataframe

In [26]:
df_dups = df_cust[df_cust.duplicated()]

In [27]:
df_dups

Empty DataFrame
Columns: [user_id, First Name, Last Name, Gender, State, Age, date_joined, number_of_dependants, fam_status, income]
Index: []

There are no duplicates in the customer dataframe.

Remove unnecessary columns from dataframes

In [28]:
df_cust = df_cust.drop(columns = ['date_joined'])

In [29]:
df_grp_ords_prods_merge3 = df_grp_ords_prods_merge3.drop(columns = ['_merge'])

Combine the Dataframes

In [30]:
df_cust_grp_merge = df_grp_ords_prods_merge3.merge(df_cust, on = 'user_id', indicator = True)

In [31]:
df_cust_grp_merge.shape

(32404859, 34)

In [ ]:
df_cust_grp_merge.info()

In [ ]:
df_cust_grp_merge.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'df_cust_grp_merge.pkl'))